app/Models/Admin/CmshBaruModel.php

SELECT `mahasiswa`.*, `jurusan`.`nama_jurusan`, `prodi`.`nama_prodi`, `tahun`.`kode_tahun`, `users`.`username`, `users`.`password`
FROM `mahasiswa`
LEFT JOIN `jurusan` ON `jurusan`.`id` = `mahasiswa`.`jurusan_id`
LEFT JOIN `prodi` ON `prodi`.`id` = `mahasiswa`.`prodi_id`
LEFT JOIN `tahun` ON `tahun`.`id` = `mahasiswa`.`tahun_id`
LEFT JOIN `users` ON `users`.`id` = `mahasiswa`.`users_id`
WHERE `mahasiswa`.`users_id` = '550'
 LIMIT 1
---
    public function getByUsersId($usersId)
    {
        return $this->select('mahasiswa.*, jurusan.nama_jurusan, prodi.nama_prodi, tahun.kode_tahun, users.username, users.password')
            ->join('jurusan', 'jurusan.id = mahasiswa.jurusan_id', 'left')
            ->join('prodi', 'prodi.id = mahasiswa.prodi_id', 'left')
            ->join('tahun', 'tahun.id = mahasiswa.tahun_id', 'left')
            ->join('users', 'users.id = mahasiswa.users_id', 'left')
            ->where('mahasiswa.users_id', $usersId)
            ->first();