app/Controllers/MahasiswaDashboard.php

SELECT `mahasiswa`.*, `prodi`.`kode_prodi`, `prodi`.`total_kelas`
FROM `mahasiswa`
LEFT JOIN `prodi` ON `prodi`.`id` = `mahasiswa`.`prodi_id`
WHERE `mahasiswa`.`id` = '4473'
 LIMIT 1
---
    public function generateNpm()
    {
        $this->response->setContentType('application/json');

        if (!$this->request->isAJAX() || $this->request->getMethod() !== 'post') {
            return $this->response->setStatusCode(405)
                ->setJSON(['npm' => 'Metode request tidak valid.']);
        }

        try {
            $idMahasiswa = $this->request->getPost('nama');
            $tglInput = $this->request->getPost('tgllahir');

            if (empty($idMahasiswa) || empty($tglInput)) {
                return $this->response->setJSON(['npm' => 'Nama dan tanggal lahir wajib diisi.']);
            }

            $model = new CmshBaruModel();
            $npmModel = new NpmModel();

            $mhs = $model
                ->select('mahasiswa.*, prodi.kode_prodi, prodi.total_kelas')
                ->join('prodi', 'prodi.id = mahasiswa.prodi_id', 'left')
                ->where('mahasiswa.id', $idMahasiswa)
                ->first();

SELECT *
FROM `npm`
WHERE `mahasiswa_id` = '4473'
 LIMIT 1
---
                ]);
            }

            $existing = $npmModel->where('mahasiswa_id', $idMahasiswa)->first();

INSERT INTO `npm` (`mahasiswa_id`, `npm`, `created_at`, `updated_at`) VALUES ('4473', '25754002', '2025-08-07 03:28:30', '2025-08-07 03:28:30')
---
                return $this->response->setJSON(['npm' => 'Gagal generate NPM.']);
            }

            $insert = $npmModel->insert([
                'mahasiswa_id' => $idMahasiswa,
                'npm' => $npmBaru,
                'created_at' => date('Y-m-d H:i:s')
            ]);

SELECT `mahasiswa`.`id`, `mahasiswa`.`nama`, `mahasiswa`.`created_at`
FROM `mahasiswa`
LEFT JOIN `prodi` ON `prodi`.`id` = `mahasiswa`.`prodi_id`
WHERE `mahasiswa`.`prodi_id` = '20'
ORDER BY `mahasiswa`.`nama` ASC, `mahasiswa`.`created_at` ASC
---
    private function generateNpmWithClassDistribution($currentMhs, $model, $npmModel): ?string
    {
        try {
            $kodeProdi = $currentMhs['kode_prodi'];
            $totalKelas = (int)$currentMhs['total_kelas'];
            $prodiId = $currentMhs['prodi_id'];

            // Ambil semua mahasiswa dari prodi yang sama, urutkan berdasarkan nama (abjad) kemudian created_at
            $allMahasiswa = $model
                ->select('mahasiswa.id, mahasiswa.nama, mahasiswa.created_at')
                ->join('prodi', 'prodi.id = mahasiswa.prodi_id', 'left')
                ->where('mahasiswa.prodi_id', $prodiId)
                ->orderBy('mahasiswa.nama', 'asc')
                ->orderBy('mahasiswa.created_at', 'asc')
                ->findAll();