app/Controllers/MahasiswaProfil.php

SELECT *
FROM `jurusan`
SELECT *
FROM `prodi`
SELECT *
FROM `tahun`
---
    public function index()
    {
        $usersId = session()->get('data')['id'];
        $mhsModel = new CmshBaruModel();
        $mahasiswa = $mhsModel->getByUsersId($usersId);

        $profilTidakLengkap = !$mahasiswa
            || empty($mahasiswa['jurusan_id'])
            || empty($mahasiswa['prodi_id'])
            || empty($mahasiswa['tahun_id'])
            || empty($mahasiswa['tgl_lahir'])
            || empty($mahasiswa['nisn'])
            || empty($mahasiswa['no_hp'])
            || empty($mahasiswa['nama_sekolah'])
            || empty($mahasiswa['tipe_sekolah'])
            || empty($mahasiswa['jurusan_asal'])
            || empty($mahasiswa['tahun_lulus']);

        $jurusanModel = new JurusanModel();
        $prodiModel = new ProdiModel();
        $tahunModel = new TahunModel();

        $data = [
            'mahasiswa' => $mahasiswa,
            'profilTidakLengkap' => $profilTidakLengkap,
            'jurusan' => $jurusanModel->findAll(),
            'prodi' => $prodiModel->findAll(),
            'tahun' => $tahunModel->findAll(),

UPDATE `users` SET `password` = '31ef9023e0109e975a57947bb867b9d5380d4c876ef51b83cac32952f785a105', `nama` = 'AHMAD REZA AFANDI'
WHERE `users`.`id` IN ('550')
---

        // Update data ke tabel users
        if (!empty($userData)) {
            $this->userModel->update($usersId, $userData);

UPDATE `mahasiswa` SET `nama` = 'AHMAD REZA AFANDI', `tgl_lahir` = '2006-06-12', `nisn` = '63331563', `nama_sekolah` = 'SMAN 1 BANDAR SRIBHAWONO', `tipe_sekolah` = 'SMA', `jurusan_asal` = 'IPS', `tahun_lulus` = '2025', `no_hp` = '8980188844', `foto` = '1754537241_32797fce9a37b0c43d30.jpg', `updated_at` = '2025-08-07 03:27:21'
WHERE `mahasiswa`.`id` IN ('4473')
---
            $mhsModel = new CmshBaruModel();
            $mahasiswa = $mhsModel->where('users_id', $usersId)->first();
            if ($mahasiswa) {
                $mhsModel->update($mahasiswa['id'], $mhsData);